blog_api/app/controllers/articles_controller.rb

  def update
    if @article.update(article_params)
---
UPDATE "articles" SET "title" = ?, "text" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Primer artículo editado"], ["text", "Este es mi primer artículo editado"], ["updated_at", "2018-04-27 18:31:06.326771"], ["id", 1]]