blog_api/app/controllers/comments_controller.rb

  def index
   @article = Article.find(params[:article_id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def show
    @article = Article.find(params[:article_id])
    @comments = @article.comments.find(params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."article_id" = ? AND "comments"."id" = ? LIMIT ?  [["article_id", 4], ["id", 4], ["LIMIT", 1]]

  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.create(comment_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "comments" ("article_id", "commenter", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["article_id", 3], ["commenter", "Diego"], ["body", "Este comentario pertenece al articulo 3"], ["created_at", "2018-04-29 13:07:29.099422"], ["updated_at", "2018-04-29 13:07:29.099422"]]